# 파이썬의 자료형은 일반형과 집합형으로 나뉜다.

# 일반형 ==> 값 하나
'''
    1. 수치
        정수 - 소수점x, (2진수, 8진수, 16진수, 10진수 표현가능)
        실수 - 소수점o
    
    2. 논리(참/거짓) - True, False

    3. 함수 - 기능처리 담당

    4. None - 값없음을 의미
'''

# 집합형 ==> 값 여러개
'''
    1. 문자형 : "", '', """""", '''''' - 값변경x
    2. 리스트 : [값, 값2, ...] - 순서o,중복o,값변경o
    3. 튜플 : (값, 값2, ...) - 순서o,중복o,값변경x
    4. 셋 : {값, 값2, ...} - 순서x,중복x
    5. 딕셔너리 : {키:값, 키2:값2, ...} - 키-밸류 쌍으로 저장
'''

# --------------------------------------------------
'''
    # 함수를 data로 처리하는 언어
        ===> python, javascript / java(x)

    # immutable 자료형(값변경 불가 자료형)
        ===> 일반형, 문자형, 튜플
'''